; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v5 - type_1 ?v7 - type_3)
 	      (pred_3 ?v3 - object ?v7 - type_3)
	      (pred_2 ?v5 - type_1 ?v2 - type_2)
	      (pred_1 ?v5 - type_1 ?v3 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v5 - type_1 ?v6 ?v8 - type_3)
       :precondition (and  (pred_4 ?v5 ?v6))
       :effect (and  (pred_4 ?v5 ?v8)
		     (not (pred_4 ?v5 ?v6))))

   (:action op_1
       :parameters (?v5 - type_1 ?v4 - object ?v1 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v1) (pred_4 ?v5 ?v1) (pred_2 ?v5 ?v2))
       :effect (and (pred_1 ?v5 ?v4 ?v2)
		    (not (pred_3 ?v4 ?v1)) 
		    (not (pred_2 ?v5 ?v2))))

   (:action op_3
       :parameters (?v5 - type_1 ?v4 - object ?v1 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v4 ?v2) (pred_4 ?v5 ?v1))
       :effect (and (pred_3 ?v4 ?v1)
		    (pred_2 ?v5 ?v2)
		    (not (pred_1 ?v5 ?v4 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_05 - type_1
obj_10 obj_07 obj_11 obj_02 - type_2
obj_01 obj_12 obj_06 - type_3
obj_04 obj_09 obj_08 - object)
(:init
(pred_4 obj_03 obj_01)
(pred_2 obj_03 obj_10)
(pred_2 obj_03 obj_07)
(pred_4 obj_05 obj_06)
(pred_2 obj_05 obj_11)
(pred_2 obj_05 obj_02)
(pred_3 obj_04 obj_12)
(pred_3 obj_09 obj_12)
(pred_3 obj_08 obj_12)
)
(:goal
(and
(pred_3 obj_04 obj_06)
(pred_3 obj_09 obj_06)
(pred_3 obj_08 obj_01)
)
)

(:constraints
  (always (not (pred_4 obj_03 obj_06)))
)
)

; plan
1. (op_2 obj_03 obj_01 obj_12)
   deleted: (pred_4 obj_03 obj_01)
   added: (pred_4 obj_03 obj_12)
   goals met: 0 of 3
2. (op_2 obj_05 obj_06 obj_12)
   deleted: (pred_4 obj_05 obj_06)
   added: (pred_4 obj_05 obj_12)
   goals met: 0 of 3
3. (op_1 obj_03 obj_08 obj_12 obj_07)
   deleted: (pred_3 obj_08 obj_12) (pred_2 obj_03 obj_07)
   added: (pred_1 obj_03 obj_08 obj_07)
   goals met: 0 of 3
4. (op_1 obj_05 obj_09 obj_12 obj_02)
   deleted: (pred_3 obj_09 obj_12) (pred_2 obj_05 obj_02)
   added: (pred_1 obj_05 obj_09 obj_02)
   goals met: 0 of 3
5. (op_1 obj_05 obj_04 obj_12 obj_11)
   deleted: (pred_3 obj_04 obj_12) (pred_2 obj_05 obj_11)
   added: (pred_1 obj_05 obj_04 obj_11)
   goals met: 0 of 3
6. (op_2 obj_03 obj_12 obj_01)
   deleted: (pred_4 obj_03 obj_12)
   added: (pred_4 obj_03 obj_01)
   goals met: 0 of 3
7. (op_2 obj_05 obj_12 obj_06)
   deleted: (pred_4 obj_05 obj_12)
   added: (pred_4 obj_05 obj_06)
   goals met: 0 of 3
8. (op_3 obj_05 obj_09 obj_06 obj_02)
   deleted: (pred_1 obj_05 obj_09 obj_02)
   added: (pred_3 obj_09 obj_06) (pred_2 obj_05 obj_02)
   goals met: 1 of 3
9. (op_3 obj_05 obj_04 obj_06 obj_11)
   deleted: (pred_1 obj_05 obj_04 obj_11)
   added: (pred_3 obj_04 obj_06) (pred_2 obj_05 obj_11)
   goals met: 2 of 3
10. (op_3 obj_03 obj_08 obj_01 obj_07)
   deleted: (pred_1 obj_03 obj_08 obj_07)
   added: (pred_3 obj_08 obj_01) (pred_2 obj_03 obj_07)
   goals met: 3 of 3
